# Author: Robin Legault <legault@mit.edu>

##########################################################################################################
################################## Entropy of the r.v. with p.m.f. ∝ ω: #################################
##########################################################################################################
# ω[p]: weight of profile p
##########################################################################################################
# H: - ∑_i ω_i*log[ω_i]
##########################################################################################################
function empirical_entropy(ω)
    pos_idx = findall(>(0), ω) # 0*log(0)=0
    pos_ω = ω[pos_idx]
    pos_ω = pos_ω./sum(pos_ω)  # normalization
    H = -pos_ω'*log.(pos_ω)
    return H
end

##########################################################################################################
# Empirical estimator of Φ_tilde(ω) based on ω_hat, estimated using |R'|=n observed nontrivial patterns. #
##########################################################################################################
# ω[p]: weight of profile p
# n   : number of observed nontrivial patterns
##########################################################################################################
# Φ: √(2/(πn))∑_{p∈P}√(ω_hat_p(1-ω_hat_p)); empirical estimator of Φ_tilde(ω)
##########################################################################################################
function empirical_estimated_expected_abs_dist(ω, n)
    ω=ω./sum(ω) # normalization
    Φ = sum([sqrt(2/pi) * sqrt(ω[i]*(1-ω[i])/n) for i in 1:length(ω)])
    return Φ
end